---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectShapeReferenceOptions
source: html/e3c263ae-9283-e9ab-3ea1-85b6f0fdadb0.htm
---
# DirectShapeReferenceOptions Properties

Specifies whether the .NET object represents a valid Revit entity.